app/views/projects/_index.html.erb

SELECT "projects".* FROM "projects"
---
  <h1>Existing Projects</h1>
  <% Project.all.each do |project| %>