app/views/projects/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "project_users" ON "users"."id" = "project_users"."collaborator_id" WHERE "project_users"."project_id" = ?  [["project_id", 4]]
---
    <div id="collaborators-list">
      <% @project.users.each do |user| %>