app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "timeframe", "finances", "description", "needs", "creator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user =  current_user
    @project = Project.new(project_params)
    @project.creator_id = @user.id
    if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def show
    @user = current_user
    @project = Project.find(params[:id])
    @creator = User.find_by(id: @project.creator_id)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]
---
  def collaborate
    @project = Project.find(params[:id])